IdeaRS.Connections
PlateShapeCode Enumeration
Compatible with IDEA StatiCa 0.0
 Represents the codes of the initial shape of plate (before editing in shape editor)
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
[FlagsAttribute]
public enum PlateShapeCode
Members
Member name | Value | Description
Rectangular | 1
Triangular | 2
Chamfer | 4
Circle | 8
WithFlange | 16
TriangularWithFlange | 18
Polygon | 19
NonRegularRectangle | 20
Trapezoid | 21
CircularSegment | 22
Ngon | 32 |  regural polygon with n sides (N-uhelnik)
OwnerShape | 64 |  A shape is defined by owner component shape. e.g. Inner stiffener of tubes.
See Also
Reference
IdeaRS.Connections.Data Namespace